package inputstream;

public class TIL {

	/*
	 stream
	  - 네트워크에서 자료의 흐름이 물과 같다는 의미에서 유래
	  - 다양한 입출력 장치에 독립적으로 일관성 있는 입출력을 제공하는 방식
	  - 대상 기준 : 입력 스트림/출력 스트림
	  - 자료의 종류 : 바이트 스트림/문자 스트림
	  - 기능 : 기반 스트림/보조 스트림
	  
	 입력 스트림 / 출력 스트림
	  - 입력 스트림 : 대상으로 부터 자료를 읽어 들이는 스트림
	  - 출력 스트림 : 대상으로 자료를 출력하는 스트림
	  - 입력 스트림과 출력 스트림은 따로 있다
	  
	 Scanner 클래스
	  - java.util 패키지에 있는 입력 클래스
	  - 문자뿐 아니라 정수, 실수 등 다른 자료형도 읽을 수 있다
	  - 여러 대상에서 자료를 읽을 수 있다
	  
	 바이트 단위 스트림
	  - FileInputStream : 파일에서 바이트 단위로 자료를 읽는다
	  
	 Reader
	  - 문자 단위로 읽는 최상위 스트림
	 */
}
